# NB Setup

In [2]:
# This cell should be run only once at start time.
#  rerunning it won't do anything if the data files already exist in the specified data_path folder, apart from resetting the frame vars
#  rerun in case of data corruption, but delete the data_path related folder from the current directory
#  code execution is compatible with both jupyter_notebook and google_colab formats

import os
import requests
import gdown
import numpy as np
import pandas as pd
import datetime as dt
import seaborn as sns

data_folder = "nb_data"
data_path = os.path.join(os.getcwd(), data_folder)

file_paths_and_url = {
    "bios.csv": "https://raw.githubusercontent.com/sebastianpacurar/ai-ds-projects/refs/heads/data_sets/data_sets/bios.csv",
    "coffee.csv": "https://raw.githubusercontent.com/sebastianpacurar/ai-ds-projects/refs/heads/data_sets/data_sets/coffee.csv",
    "noc_regions.csv": "https://raw.githubusercontent.com/sebastianpacurar/ai-ds-projects/refs/heads/data_sets/data_sets/noc_regions.csv",
    "nyc_jobs.csv": "https://raw.githubusercontent.com/sebastianpacurar/ai-ds-projects/refs/heads/data_sets/data_sets/NYC_Jobs.csv"
}

g_drive_paths_and_url = {
    "RewardsData.csv": "https://drive.google.com/uc?export=download&id=1xYz0MCT0-xLYx5H-Z4a25K6jL5-MTe6X"
}


def path_to(f_path):
    return os.path.join(data_path, f_path)


# create root folder for this notebook's data sets
def create_data_sets_folder():
    if not os.path.exists(data_path):
        os.makedirs(data_path)
        print(f"Folder {data_path} created in {os.getcwd()}")
    else:
        print(f"Folder {data_path} already exists in {os.getcwd()}")


# download data set files from github repos, and store them in data_path
def download_raw_git_files():
    for f_name, f_url in file_paths_and_url.items():
        f_path = os.path.join(data_path, f_name)
        if not os.path.exists(f_path):
            res = requests.get(f_url)
            with open(f_path, "wb") as file:
                file.write(res.content)
            print(f"File \"{f_name}\" downloaded in {data_path}")
        else:
            print(f"Skip File \"{f_name}\"; already exists in {data_path}")


# download data set files from google drive locations by id
def download_google_drive_files():
    for f_name, f_url in g_drive_paths_and_url.items():
        f_path = os.path.join(data_path, f_name)
        if not os.path.exists(f_path):
            f_id = f_url.split("&id=")[1]
            gdown.download(f"https://drive.google.com/uc?export=download&id={f_id}", path_to(f_name), quiet=True)
            print(f'\nFile "{f_name}" downloaded in {data_path}')
        else:
            print(f'Skip File "{f_name}"; already exists in {data_path}')


def load_csv_data_set(f_path):
    try:
        df = pd.read_csv(path_to(f_path))
        print(f'Loaded "{f_path}" to Dataframe')
        return df
    except:
        print(f'Something went wrong with loading the "{f_path}"')


# download data sets if they don't exist
create_data_sets_folder()
download_google_drive_files()
download_raw_git_files()

# load data sets into data frames for sample use
bios = load_csv_data_set("bios.csv")
coffee = load_csv_data_set("coffee.csv")
nocs = load_csv_data_set("noc_regions.csv")
nyc_jobs = load_csv_data_set("nyc_jobs.csv")
rewards = load_csv_data_set("RewardsData.csv")

Folder C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials
Skip File "RewardsData.csv"; already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data
Skip File "bios.csv"; already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data
Skip File "coffee.csv"; already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data
Skip File "noc_regions.csv"; already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data
Skip File "nyc_jobs.csv"; already exists in C:\Users\pacur\Documents\git\ai-ds-projects\study_materials\nb_data
Loaded "bios.csv" to Dataframe
Loaded "coffee.csv" to Dataframe
Loaded "noc_regions.csv" to Dataframe
Loaded "nyc_jobs.csv" to Dataframe
Loaded "RewardsData.csv" to Dataframe

<br><hr><hr><br>

# 1) Basics

<br><hr><br>

## 1.1 - loc(), iloc(), at(), iat()

* Syntax
<table>
  <tr>
    <th>Task</th>
    <th>.loc[]</th>
    <th>.iloc[]</th>
    <th>.at[]</th>
    <th>.iat[]</th>
  </tr>
  <tr>
    <td>1 Row</td>
    <td>df.loc[0, :]</td>
    <td>df.iloc[0, :]</td>
    <td>No</td>
    <td>No</td>
  </tr>
  <tr>
    <td>1 Column</td>
    <td>df.loc[:, 'Price']</td>
    <td>df.iloc[:, 1]</td>
    <td>No</td>
    <td>No</td>
  </tr>
  <tr>
    <td>n Rows</td>
    <td>df.loc[0:1, :]</td>
    <td>df.iloc[0:2, :]</td>
    <td>No</td>
    <td>No</td>
  </tr>
  <tr>
    <td>n Columns</td>
    <td>df.loc[:, ['Price', 'Quantity']]</td>
    <td>df.iloc[:, [1, 2]]</td>
    <td>No</td>
    <td>No</td>
  </tr>
  <tr>
    <td>Single value by label</td>
    <td>df.loc[0, 'Price']</td>
    <td>No</td>
    <td>df.at[0, 'Price']</td>
    <td>No</td>
  </tr>
  <tr>
    <td>Single value by index</td>
    <td>No</td>
    <td>df.iloc[0, 1]</td>
    <td>No</td>
    <td>df.iat[0, 1]</td>
  </tr>
  <tr>
    <td>Rows where Price > 5</td>
    <td>df.loc[df['Price'] > 5, :]</td>
    <td>No</td>
    <td>No</td>
    <td>No</td>
  </tr>
</table>

</br>

* When to use which
<table>
  <tr>
    <th>Scenario</th>
    <th>.loc[]</th>
    <th>.iloc[]</th>
    <th>.at[]</th>
    <th>.iat[]</th>
  </tr>
  <tr>
    <td>Need to retrieve a single value</td>
    <td>X</td>
    <td>X</td>
    <td>O</td>
    <td>O</td>
  </tr>
  <tr>
    <td>Need to retrieve multiple rows/columns</td>
    <td>O</td>
    <td>O</td>
    <td>X</td>
    <td>X</td>
  </tr>
  <tr>
    <td>Need to modify one cell efficiently</td>
    <td>X</td>
    <td>X</td>
    <td>O</td>
    <td>O</td>
  </tr>
  <tr>
    <td>Need to modify multiple values</td>
    <td>O</td>
    <td>O</td>
    <td>X</td>
    <td>X</td>
  </tr>
  <tr>
    <td>Accessing with labels (row and column names)</td>
    <td>O</td>
    <td>X</td>
    <td>O</td>
    <td>X</td>
  </tr>
  <tr>
    <td>Accessing with index positions</td>
    <td>X</td>
    <td>O</td>
    <td>X</td>
    <td>O</td>
  </tr>
  <tr>
    <td>Filtering with conditions</td>
    <td>O</td>
    <td>X</td>
    <td>X</td>
    <td>X</td>
  </tr>
</table>

In [7]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [8]:
# return the first row in a key and value columns
coffee_sample = coffee.copy()

with_loc = coffee_sample.loc[0, :]
with_iloc = coffee_sample.iloc[0, :]

display(with_loc)
display(with_iloc)

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [9]:
# select column Coffee Type
coffee_sample = coffee.copy()

with_loc = coffee_sample.loc[:, "Coffee Type"].head()
with_iloc = coffee_sample.iloc[:, 1].head()

display(with_loc)
display(with_iloc)

0    Espresso
1       Latte
2    Espresso
3       Latte
4    Espresso
Name: Coffee Type, dtype: object

0    Espresso
1       Latte
2    Espresso
3       Latte
4    Espresso
Name: Coffee Type, dtype: object

In [10]:
# select columns Day and Units Sold
coffee_sample = coffee.copy()

with_loc = coffee_sample.loc[:, ["Day", "Units Sold"]].head()
with_iloc = coffee_sample.iloc[:, [0, 2]].head()

display(with_loc)
display(with_iloc)

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [11]:
# grab first, third, fourth, sixth rows, for Day and Units Sold columns

coffee_sample = coffee.copy()

with_loc = coffee_sample.loc[[0, 2, 4, 6], ["Day", "Units Sold"]]
with_iloc = coffee_sample.iloc[[0, 2, 4, 6], [0, 2]]

display(with_loc)
display(with_iloc)

         Day  Units Sold
0     Monday          25
2    Tuesday          30
4  Wednesday          35
6   Thursday          40

         Day  Units Sold
0     Monday          25
2    Tuesday          30
4  Wednesday          35
6   Thursday          40

In [12]:
# set the first row, Units Sold column to be equal to 10 instead of 15
coffee_sample = coffee.copy()

coffee_sample.loc[1, "Units Sold"] = 10
coffee_sample.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [13]:
# change units sold to 100 for first 5 entries
coffee_sample = coffee.copy()

coffee_sample.loc[0:5, "Units Sold"] = 100
coffee_sample.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso         100
1     Monday       Latte         100
2    Tuesday    Espresso         100
3    Tuesday       Latte         100
4  Wednesday    Espresso         100

In [14]:
coffee_sample = coffee.copy()

# get units sold for row 0
units_sold_row_0 = coffee_sample.at[0, "Units Sold"]

# this won't work, because at() and iat() are scalars only
# coffee.at[0:3, "Units Sold"]

first_row_first_col = coffee_sample.iat[0, 0]
units_sold_row_0, first_row_first_col

(25, 'Monday')

<br><hr><br>

## 1.2 - Grab Columns and Sort Values

In [17]:
# sort values based on Units Sold in ascending order

coffee_sample = coffee.copy()
coffee_sample.sort_values("Units Sold")

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [18]:
# sort values based on Units Sold in descending order

coffee_sample = coffee.copy()
coffee_sample.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [19]:
# sort based on Units Sold, and then sort based on Coffee Type in descending order
#  first sort is done by Units Sold, and if there is the same value for Units Sold under different Coffee Type, then sort based on that as well
#  ascending=[0,1] means sort units sold in descending order, and coffee type in ascending order. Since coffee type is a string it will be sorted alphabetically

coffee_sample = coffee.copy()
coffee_sample.sort_values(["Units Sold", "Coffee Type"], ascending=[0, 1])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [20]:
# iterate through rows. not recommended because it loses some of the memory performance benefits
#  the below iterates through the row and prints the index and units sold for every row
for index, row in coffee_sample.iterrows():
    print(f'index {index} has {row["Units Sold"]} of Units Sold')

index 0 has 25 of Units Sold
index 1 has 15 of Units Sold
index 2 has 30 of Units Sold
index 3 has 20 of Units Sold
index 4 has 35 of Units Sold
index 5 has 25 of Units Sold
index 6 has 40 of Units Sold
index 7 has 30 of Units Sold
index 8 has 45 of Units Sold
index 9 has 35 of Units Sold
index 10 has 45 of Units Sold
index 11 has 35 of Units Sold
index 12 has 45 of Units Sold
index 13 has 35 of Units Sold

<br><hr><br>

## 1.3 - Adding and Removing Columns

In [23]:
coffee_sample = coffee.copy()
coffee_sample

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
# add column price
coffee_sample['price'] = 4.99
coffee_sample

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [25]:
# adding a column based on conditional. using np.where to add 3.99 for Espresso, and 5.99 for anything which is not Espresso
coffee_sample['new_price'] = np.where(coffee["Coffee Type"] == "Espresso", 3.99, 5.99)
coffee_sample.head(2)

      Day Coffee Type  Units Sold  price  new_price
0  Monday    Espresso          25   4.99       3.99
1  Monday       Latte          15   4.99       5.99

In [26]:
# how to remove a column, but it just returns a new dataframe
coffee_sample.drop(columns=["price"]).head(2)

      Day Coffee Type  Units Sold  new_price
0  Monday    Espresso          25       3.99
1  Monday       Latte          15       5.99

In [27]:
# by adding inplace=True, will update the original coffee dataframe
coffee_sample.drop(columns=["price"], inplace=True)
coffee_sample.head(2)

      Day Coffee Type  Units Sold  new_price
0  Monday    Espresso          25       3.99
1  Monday       Latte          15       5.99

In [28]:
# add a column revenue, which is equal to Units Sold * new_price for every row
coffee_sample["revenue"] = coffee_sample["Units Sold"] * coffee_sample['new_price']
coffee_sample.head(2)

      Day Coffee Type  Units Sold  new_price  revenue
0  Monday    Espresso          25       3.99    99.75
1  Monday       Latte          15       5.99    89.85

In [29]:
# rename new_price column to price. Remember to add inplace to update the original dataframe instead of returning a new one
#  AVOID USING inplace as it will be decommissioned!!!! use object allocation instead
coffee_sample.rename(columns={'new_price': 'renamed_price'}, inplace=True)
coffee_sample.head()

         Day Coffee Type  Units Sold  renamed_price  revenue
0     Monday    Espresso          25           3.99    99.75
1     Monday       Latte          15           5.99    89.85
2    Tuesday    Espresso          30           3.99   119.70
3    Tuesday       Latte          20           5.99   119.80
4  Wednesday    Espresso          35           3.99   139.65

In [30]:
# make a copy of bios() to perform operations on it
bios_new = bios.copy()
bios_new.head(2)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN

In [31]:
# add 2 new columns first_name and last_name, which are based on the name column split,
#  where first element is first_name and second element is last_name
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]
bios_new['last_name'] = bios_new['name'].str.split(' ').str[1]
bios_new.head(2)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,Blanchy
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch

In [32]:
bios_new.info()  # check first_name and last_name created columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
 11  last_name     145500 non-null  object
dtypes: float64(2), int64(1), object(9)
memory usage: 13.3+ MB

In [33]:
# add a new column converted to datetime of pandas
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], errors='coerce')
bios_new.info()  # check born_datetime created column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  last_name      145500 non-null  object
 12  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(9)
memory usage: 14.4+ MB

In [34]:
# since born_year is a dt (datetime) object, you can extract various info from it, like year
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new.info()  # check born_year created column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 14 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  last_name      145500 non-null  object
 12  born_datetime  143693 non-null  datetime64[ns]
 13  born_year      143693 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(9)
memory usage: 15.5+ MB

In [35]:
bios_new[['name', 'born_year']].head()  # retrieve the entries with name and born_year columns displayed only

                    name  born_year
0  Jean-Franois Blanchy     1886.0
1         Arnaud Boetsch     1969.0
2           Jean Borotra     1898.0
3        Jacques Brugnon     1895.0
4           Albert Canet     1878.0

In [36]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 and row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'


# using a custom function without lambda, on the row axis
bios['Category'] = bios.apply(categorize_athlete, axis=1)
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Heavyweight

<br><hr><br>

## 1.4 - Merging and Concatenating

In [39]:
nocs_sample = nocs.copy()
bios_sample = bios.copy()
nocs_sample.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [40]:
# inner join between bios and nocs, ON born_country column for bios and NOC column for nocs
bios_new = pd.merge(bios_sample, nocs_sample, left_on='born_country', right_on='NOC', how='left')
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,Category,NOC_y,region,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Heavyweight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Middleweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Middleweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Heavyweight,GBR,UK,NaN

In [41]:
# concat 2 data frames
usa = bios_sample[bios_sample['born_country'] == 'USA'].copy()  # only born in USA data frame
gb = bios_sample[bios_sample['born_country'] == 'GBR'].copy()  # only born in UK data frame

new_df = pd.concat([usa, gb])
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,Middleweight
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,Lightweight
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,Lightweight
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,Heavyweight
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,Lightweight

In [42]:
results = bios.copy()

# merge to dataframes together under a shared column
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

combined_df.head()

,athlete_id,name_x,born_date_x,born_city_x,born_region_x,born_country_x,NOC_x,height_cm_x,weight_kg_x,died_date_x,...,name_y,born_date_y,born_city_y,born_region_y,born_country_y,NOC_y,height_cm_y,weight_kg_y,died_date_y,Category_y
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,...,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,...,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,...,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,...,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,...,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Heavyweight

<br><hr><br>

## 1.5 - Handle Null values (TODO)

In [45]:
# TODO

<br><hr><br>

## 1.6 - apply()

In [48]:
nyc_jobs_sample = nyc_jobs.copy()
nyc_jobs_sample_2 = nyc_jobs.copy()

# apply a function across a column
nyc_jobs_sample["Salary From Sqrt"] = nyc_jobs_sample["Salary Range From"].apply(np.sqrt)
nyc_jobs_sample["Salary To Sqrt"] = nyc_jobs_sample["Salary Range To"].apply(np.sqrt)
display(nyc_jobs_sample[["Salary Range From", "Salary From Sqrt", "Salary Range To", "Salary To Sqrt"]])

# apply a function across multiple columns (defaults to col-wise: axis=0)
cols_changed = display(nyc_jobs_sample_2[["Salary Range From", "Salary Range To"]].apply(np.sqrt))
display(cols_changed)

      Salary Range From  Salary From Sqrt  Salary Range To  Salary To Sqrt
0               84252.0        290.261951          84252.0      290.261951
1               82884.0        287.895814         116391.0      341.161252
2              105000.0        324.037035         125000.0      353.553391
3               87203.0        295.301541         131623.0      362.798842
4               58449.0        241.762280          67216.0      259.260487
...                 ...               ...              ...             ...
3768            85371.0        292.183162         119883.0      346.241245
3769            74650.0        273.221522          85847.0      292.996587
3770           100000.0        316.227766         115000.0      339.116499
3771            42288.0        205.640463          59400.0      243.721152
3772            62397.0        249.793915          71757.0      267.874971

[3773 rows x 4 columns]

      Salary Range From  Salary Range To
0            290.261951       290.261951
1            287.895814       341.161252
2            324.037035       353.553391
3            295.301541       362.798842
4            241.762280       259.260487
...                 ...              ...
3768         292.183162       346.241245
3769         273.221522       292.996587
3770         316.227766       339.116499
3771         205.640463       243.721152
3772         249.793915       267.874971

[3773 rows x 2 columns]

None

In [49]:
# apply row-wise, col-wise operations
nyc_jobs_sample = nyc_jobs.copy()
display(nyc_jobs_sample[['Salary Range From', 'Salary Range To']].head())

# apply row-wise operation, mean of "Salary Range From" and "Salary Range To" on each row
nyc_jobs_sample["Salary Mean"] = nyc_jobs_sample[['Salary Range From', 'Salary Range To']].apply(np.mean, axis=1)
display(nyc_jobs_sample[["Salary Range From", "Salary Range To", "Salary Mean"]].head())

# apply column-wise operation, mean of "Salary Range From" for all jobs and "Salary Range To" for all jobs
display(nyc_jobs_sample[['Salary Range From', 'Salary Range To']].apply(np.mean, axis=0))

   Salary Range From  Salary Range To
0            84252.0          84252.0
1            82884.0         116391.0
2           105000.0         125000.0
3            87203.0         131623.0
4            58449.0          67216.0

   Salary Range From  Salary Range To  Salary Mean
0            84252.0          84252.0      84252.0
1            82884.0         116391.0      99637.5
2           105000.0         125000.0     115000.0
3            87203.0         131623.0     109413.0
4            58449.0          67216.0      62832.5

Salary Range From    57657.939466
Salary Range To      79660.249595
dtype: float64

In [50]:
# apply custom functions

def capitalize_position(title):
    title_lower = title.lower()
    title_final = title_lower.title()
    return title_final


nyc_jobs_sample = nyc_jobs.copy()

nyc_jobs_sample["Civil Service Updated"] = nyc_jobs_sample["Civil Service Title"].apply(capitalize_position)
nyc_jobs_sample[["Civil Service Title", "Civil Service Updated"]].head()

              Civil Service Title           Civil Service Updated
0             PUBLIC HEALTH NURSE             Public Health Nurse
1         CERT IT DEVELOPER (APP)         Cert It Developer (App)
2        EXECUTIVE AGENCY COUNSEL        Executive Agency Counsel
3  CERTIFIED IT ADMINISTRATOR (LA  Certified It Administrator (La
4  ASSOCIATE HUMAN RIGHTS SPECIAL  Associate Human Rights Special

In [51]:
# using anonymous functions

nyc_jobs_sample = nyc_jobs.copy()

nyc_jobs_sample["Civil Service Lower"] = nyc_jobs_sample["Civil Service Title"].apply(lambda x: x.lower().title())
nyc_jobs_sample[["Civil Service Title", "Civil Service Lower"]].head()

              Civil Service Title             Civil Service Lower
0             PUBLIC HEALTH NURSE             Public Health Nurse
1         CERT IT DEVELOPER (APP)         Cert It Developer (App)
2        EXECUTIVE AGENCY COUNSEL        Executive Agency Counsel
3  CERTIFIED IT ADMINISTRATOR (LA  Certified It Administrator (La
4  ASSOCIATE HUMAN RIGHTS SPECIAL  Associate Human Rights Special

In [52]:
# result_type argument in apply()
nyc_jobs_sample = nyc_jobs.copy()

# get every row under a single column, as list type, where every element is the initial column
display(nyc_jobs_sample.apply(lambda x: x.tolist(), axis=1).head())

# use "expand" to split the list into columns, but the column names are incremented ints:
display(nyc_jobs_sample.apply(lambda x: x.tolist(), axis=1, result_type='expand').head())

# use "broadcast" to have the same behavior as "expand", but keep the initial column names
display(nyc_jobs_sample.apply(lambda x: x.tolist(), axis=1, result_type='broadcast').head())

0    [424339, DEPT OF HEALTH/MENTAL HYGIENE, Extern...
1    [379094, NYC EMPLOYEES RETIREMENT SYS, Externa...
2    [520417, NYC HOUSING AUTHORITY, External, 1, C...
3    [233549, NYC EMPLOYEES RETIREMENT SYS, Externa...
4    [510256, HUMAN RIGHTS COMMISSION, External, 5,...
dtype: object

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,424339,DEPT OF HEALTH/MENTAL HYGIENE,External,1,"Triage Nurse, Bureau of Public Health Clinics",PUBLIC HEALTH NURSE,Competitive-1,51011,03,Health,...,**IMPORTANT NOTES TO ALL CANDIDATES: Please ...,Apply online with a cover letter to https://a1...,NaN,NaN,NaN,New York City Residency is not required for th...,03/01/2022,NaN,04/05/2022,04/12/2022
1,379094,NYC EMPLOYEES RETIREMENT SYS,External,1,CERTIFIED IT DEVELOPER (APPLICATIONS),CERT IT DEVELOPER (APP),Competitive-1,13643,02,"Technology, Data & Innovation",...,NaN,"TO APPLY FOR CONSIDERATION, PLEASE FORWARD A C...",NaN,NaN,NaN,New York City Residency is not required for th...,01/07/2019,NaN,01/07/2019,04/12/2022
2,520417,NYC HOUSING AUTHORITY,External,1,Chief of Settlement,EXECUTIVE AGENCY COUNSEL,Non-Competitive-5,95005,M2,Legal Affairs,...,1. Resume and cover letter must also include ...,Click the Apply Now button.,NaN,NaN,NaN,NYCHA has no residency requirements.,03/28/2022,NaN,03/28/2022,04/12/2022
3,233549,NYC EMPLOYEES RETIREMENT SYS,External,1,"CERTIFIED IT ADMINISTRATOR (LAN/WAN), LEVEL 4",CERTIFIED IT ADMINISTRATOR (LA,Competitive-1,13652,04,Information Technology & Telecommunications,...,NaN,Click the 'apply now' button to apply. Please...,NaN,NaN,NaN,New York City Residency is not required for th...,03/01/2016,NaN,03/01/2016,04/12/2022
4,510256,HUMAN RIGHTS COMMISSION,External,5,Associate Human Rights Specialist,ASSOCIATE HUMAN RIGHTS SPECIAL,Competitive-1,55038,01,Constituent Services & Community Programs,...,NaN,For City employees: Go to Employee Self-Servic...,": DAY, 9-5; ON OCCASION, CANDIDATES MAY BE REQ...","22 Reade St, Ny",NaN,New York City residency is generally required ...,12/16/2021,NaN,12/16/2021,04/12/2022

,Job ID,Agency,Posting Type,# Of Positions,Business Title,Civil Service Title,Title Classification,Title Code No,Level,Job Category,...,Additional Information,To Apply,Hours/Shift,Work Location 1,Recruitment Contact,Residency Requirement,Posting Date,Post Until,Posting Updated,Process Date
0,424339,DEPT OF HEALTH/MENTAL HYGIENE,External,1,"Triage Nurse, Bureau of Public Health Clinics",PUBLIC HEALTH NURSE,Competitive-1,51011,03,Health,...,**IMPORTANT NOTES TO ALL CANDIDATES: Please ...,Apply online with a cover letter to https://a1...,NaN,NaN,NaN,New York City Residency is not required for th...,03/01/2022,NaN,04/05/2022,04/12/2022
1,379094,NYC EMPLOYEES RETIREMENT SYS,External,1,CERTIFIED IT DEVELOPER (APPLICATIONS),CERT IT DEVELOPER (APP),Competitive-1,13643,02,"Technology, Data & Innovation",...,NaN,"TO APPLY FOR CONSIDERATION, PLEASE FORWARD A C...",NaN,NaN,NaN,New York City Residency is not required for th...,01/07/2019,NaN,01/07/2019,04/12/2022
2,520417,NYC HOUSING AUTHORITY,External,1,Chief of Settlement,EXECUTIVE AGENCY COUNSEL,Non-Competitive-5,95005,M2,Legal Affairs,...,1. Resume and cover letter must also include ...,Click the Apply Now button.,NaN,NaN,NaN,NYCHA has no residency requirements.,03/28/2022,NaN,03/28/2022,04/12/2022
3,233549,NYC EMPLOYEES RETIREMENT SYS,External,1,"CERTIFIED IT ADMINISTRATOR (LAN/WAN), LEVEL 4",CERTIFIED IT ADMINISTRATOR (LA,Competitive-1,13652,04,Information Technology & Telecommunications,...,NaN,Click the 'apply now' button to apply. Please...,NaN,NaN,NaN,New York City Residency is not required for th...,03/01/2016,NaN,03/01/2016,04/12/2022
4,510256,HUMAN RIGHTS COMMISSION,External,5,Associate Human Rights Specialist,ASSOCIATE HUMAN RIGHTS SPECIAL,Competitive-1,55038,01,Constituent Services & Community Programs,...,NaN,For City employees: Go to Employee Self-Servic...,": DAY, 9-5; ON OCCASION, CANDIDATES MAY BE REQ...","22 Reade St, Ny",NaN,New York City residency is generally required ...,12/16/2021,NaN,12/16/2021,04/12/2022

<br><hr><hr><br>

# 2) Filtering Data

<br><hr><br>

### 2.1 - Standard filtering

In [57]:
bios_sample = bios.copy()
bios_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  Category      145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [58]:
# filter the athletes with a height higher than 215 cm
bios_sample.loc[bios_sample['height_cm'] > 215].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24,Heavyweight
5583,5606,Paulinho Villas Boas,1963-01-26,So Paulo,So Paulo,BRA,Brazil,217.0,106.0,NaN,Heavyweight
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN,Heavyweight
5716,5739,Uwe Blab,1962-03-26,Mnchen (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN,Heavyweight
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN,Heavyweight

In [59]:
# filter the rows based on height_cm, and grab only the name and height_cm columns
bios_sample.loc[bios_sample["height_cm"] > 215, ["name", "height_cm"]].head()

                       name  height_cm
5089     Viktor Pankrashkin      220.0
5583   Paulinho Villas Boas      217.0
5673         Gunther Behnke      221.0
5716               Uwe Blab      218.0
5781         Tommy Burleson      223.0

In [60]:
# same as the above but using binary syntax (bracket syntax). it's just a syntactic sugar for the above
bios_sample[(bios_sample["height_cm"] > 215)][["name", "height_cm"]].head()

                       name  height_cm
5089     Viktor Pankrashkin      220.0
5583   Paulinho Villas Boas      217.0
5673         Gunther Behnke      221.0
5716               Uwe Blab      218.0
5781         Tommy Burleson      223.0

In [61]:
# return the entries (name, height and born_city) with height_cm greater than 215 who were born in USA country
bios_sample[(bios_sample["height_cm"] > 215) & (bios_sample["born_country"] == "USA")][["name", "height_cm", "born_city"]].head()

                    name  height_cm  born_city
5781      Tommy Burleson      223.0  Crossnore
6722    Shaquille O'Neal      216.0     Newark
6937      David Robinson      216.0   Key West
123850    Tyson Chandler      216.0    Hanford

In [62]:
# return the entries whose name column starts with "Keith"
#   str returns the string property of a data frame field
bios_sample[bios_sample["name"].str.contains('Keith')].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Heavyweight
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Lightweight
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Heavyweight
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Heavyweight
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Heavyweight

In [63]:
# return the entries whose name column starts with "keith", and ignore case sensitivity
bios_sample[bios_sample["name"].str.contains("keith", case=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Heavyweight
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Lightweight
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Heavyweight
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Heavyweight
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Heavyweight

In [64]:
# return the entries whose name column starts with "keith" or "patrick", and ignore case sensitivity
bios_sample[bios_sample["name"].str.contains("keith|patrick", case=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,Middleweight
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05,Heavyweight
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN,Heavyweight
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Heavyweight
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN,Middleweight

In [65]:
# find athletes born in cities that start with a vowel
bios_sample[bios_sample["born_city"].str.contains(r"^[AEIOUY]", na=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN,Middleweight
10,11,"lie, Comte de Lastours",1874-08-12,Orgeval,Yvelines,FRA,France,NaN,NaN,1932-11-18,Heavyweight
17,18,Jean-Philippe Gatien,1968-10-16,Als,Gard,FRA,France,178.0,73.0,NaN,Middleweight
35,36,tienne Thobois,1967-09-20,Amiens,Somme,FRA,France,186.0,78.0,NaN,Heavyweight
40,41,Julie Bradbury,1967-02-12,Oxford,England,GBR,Great Britain,175.0,64.0,NaN,Middleweight

In [66]:
# find athletes with names ending in 'son' or 'sen'
bios[bios["name"].str.contains(r"(?:sen$|son$)", na=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26,Heavyweight
92,93,Anne Gibson,1968-10-26,Dumfries,Scotland,GBR,Great Britain,173.0,70.0,NaN,Middleweight
107,108,Anders Nielsen,1967-02-24,Cape Town,Western Cape,RSA,Great Britain,173.0,70.0,2010-07-29,Middleweight
113,114,Julian Robertson,1969-10-09,Peterborough,England,GBR,Great Britain,182.0,73.0,NaN,Middleweight
120,121,Chris Wilkinson,1970-01-05,Southampton,England,GBR,Great Britain,180.0,72.0,NaN,Middleweight

In [67]:
# find athletes with names that start and end with the same letter
# not working
bios_sample[bios_sample["name"].str.contains(r"^(.).*\1$", na=False)]

C:\Users\pacur\AppData\Local\Temp\ipykernel_1588\856822541.py:3: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  bios_sample[bios_sample["name"].str.contains(r"^(.).*\1$", na=False)]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date, Category]
Index: []

In [68]:
# find athletes with a born_city that has exactly 7 characters:
bios_sample[bios_sample["name"].str.contains(r"^.{7}$", na=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
366,367,Vi Muir,1934-11-04,Duncan,British Columbia,CAN,Canada,170.0,NaN,NaN,Heavyweight
381,382,He Ying,1977-04-17,Siping,Jilin,CHN,People's Republic of China,170.0,68.0,NaN,Lightweight
394,395,Hao Wei,1968-10-30,NaN,NaN,NaN,People's Republic of China,184.0,70.0,NaN,Middleweight
646,649,Ding Yi,1959-01-14,Shanghai,Shanghai,CHN,Austria,166.0,68.0,NaN,Lightweight
776,780,Chen Li,1971-03-13,Xiangtan,Hunan,CHN,People's Republic of China,165.0,60.0,NaN,Lightweight

In [69]:
# find athletes with names containing three or more vowels:
bios_sample[bios_sample["name"].str.contains(r"(?:[AEIOUaeiou].*){3,}", na=False)].head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Heavyweight

In [70]:
# a more complex filtering with multiple conditions

bios_sample['died_date'] = pd.to_datetime(bios_sample['died_date'], errors='coerce')
bios_sample['born_date'] = pd.to_datetime(bios_sample['died_date'], errors='coerce')

ro_players = bios[
    (bios_sample['born_country'].str.contains(r'^RO', na=False, case=False)) &
    (bios_sample['born_city'].str.contains(r'^cluj', na=False, case=False)) &
    (bios_sample['died_date'].notna()) &
    (bios_sample['born_date'].dt.year >= 1900)
    ][['name', 'born_date', 'height_cm', 'weight_kg']]
ro_players

                             name   born_date  height_cm  weight_kg
7883                Iosif Mihalic  1938-11-13      171.0       60.0
12150                  Pl Kemry  1887-12-15        NaN        NaN
20758  Ileana Gyulai-Drmb-Jenei  1946-06-12      164.0       61.0
20765            Olga Orban-Szabo  1938-10-09      161.0       55.0
21263                   Imre Nagy  1941-05-07      189.0       78.0
22369           Tibor Szkelyhidy  1904-02-20        NaN        NaN
23046        Adalbert Gurath, Sr.  1915-07-07        NaN        NaN
23069                Tudor Petru  1949-10-02      175.0       66.0
23077             Ladislau Rohony  1938-09-01      184.0       76.0
26888           Nicolae Bonciocat  1898-04-13        NaN        NaN
28798                Olga Gllner  1930-11-08        NaN        NaN
30685              Andrei Abraham  1916-10-07        NaN        NaN
30686                  Ion Albert  1910-06-02        NaN        NaN
37916                 Bla Zoltn  1901-12-17        NaN        NaN
42478              Istvn Prihoda  1891-11-15        NaN        NaN
47824              Jzsef Fabinyi  1887-03-31        NaN        NaN
53786                Lszl Jeney  1923-05-30      181.0       77.0
54223           Adalbert Iordache  1919-01-28        NaN        NaN
56204                 Bala Fitzi  1941-01-02      153.0        NaN
56217              tefan Tanadi  1953-03-21      183.0      110.0
70753               Istvn Somodi  1885-08-22      175.0       63.0

<br><hr><br>

### 2.2 - query()

In [73]:
# basic number calculations
df = sns.load_dataset("taxis")
df.query("passengers == 3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.1,0.0,13.4,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

In [74]:
# equal string
df.query("pickup_borough == 'Manhattan'").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [75]:
# and
df.query("pickup_borough == 'Manhattan' and passengers != 3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [76]:
# or
df.query("pickup_borough == 'Manhattan' or passengers != 3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [77]:
# in
df.query("pickup_borough in ('Manhattan', 'Brooklyn')").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [78]:
# not in
df.query("pickup_borough not in ('Manhattan', 'Brooklyn')").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
10,2019-03-16 10:02:25,2019-03-16 10:22:29,1,3.9,17.0,0.0,0.0,17.8,yellow,cash,LaGuardia Airport,Astoria,Queens,Queens

In [79]:
borough = ["Manhattan", "Bronx", "Queens"]
df.query("pickup_borough in @borough").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [80]:
passengers_var = 5
df.query("passengers == @passengers_var").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
23,2019-03-04 12:15:39,2019-03-04 12:26:53,5,1.09,8.5,2.36,0.0,14.16,yellow,credit card,Sutton Place/Turtle Bay North,Midtown North,Manhattan,Manhattan

In [81]:
# math operation within function use * to highlight start of operation
df.query("passengers *3 < 3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
7,2019-03-22 12:47:13,2019-03-22 12:58:17,0,1.4,8.5,0.0,0.0,11.8,yellow,NaN,Murray Hill,Flatiron,Manhattan,Manhattan

In [82]:
# strings functions
df.query("color.str.contains('yel')").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [83]:
# dates
df.query("dropoff.dt.month == 2").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
6203,2019-02-28 23:29:03,2019-02-28 23:32:35,1,0.9,5.0,0.0,0.0,6.3,green,cash,Old Astoria,Long Island City/Queens Plaza,Queens,Queens

In [84]:
# null values
df.query('pickup_borough.isna() == 1').head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
42,2019-03-30 23:59:14,2019-03-30 23:59:17,1,0.0,80.0,20.08,0.0,100.38,yellow,credit card,NaN,NaN,NaN,NaN

In [85]:
# grab a series or column after query
df.query("dropoff.dt.day == 10")[["pickup", "dropoff", "total", "payment"]].head(1)

               pickup             dropoff  total      payment
3 2019-03-10 01:23:59 2019-03-10 01:49:51  36.95  credit card

In [86]:
# make changes to original dataframe
df2 = df.copy()
df2.query("color == 'yellow'", inplace=True)
df2.head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [87]:
# get trips where the fare is above $50, but the distance is less than 3 miles
df.query("fare > 50 and distance < 3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
42,2019-03-30 23:59:14,2019-03-30 23:59:17,1,0.0,80.0,20.08,0.0,100.38,yellow,credit card,NaN,NaN,NaN,NaN

In [88]:
# get trips with tips greater than 30% of fare
df.query("tip / fare > 0.3").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.6,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan

In [89]:
# get night-time trips with high fares:
#  pickup_borough = Manhattan
#  pickup = 00:00 - 4:00
#  fare is above 40$
df.query("pickup_borough == 'Manhattan' and 0 <= pickup.dt.hour <= 4 and fare > 40").head(1)

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
393,2019-03-22 04:46:14,2019-03-22 05:16:28,5,18.94,52.0,12.21,5.76,73.27,yellow,credit card,Upper East Side North,JFK Airport,Manhattan,Queens

<br><hr><br>

### 2.3 - where()

* The opposite of **mask()**
    * Keeps the values when condition is True and replaces others
    * The values that do not meet the condition are replaced with a specified value (defaults to NaN)
* Used when you want to **keep values that meet a condition and replace others**

#### 2.3.1 - Series

In [93]:
np.random.seed(0)
s = pd.Series(np.random.randint(0, 1000, 5), index=list('abcde'))
s

a    684
b    559
c    629
d    192
e    835
dtype: int32

In [94]:
# get the series with the kept value if the value > 300, else return NaN for that value
s.where(s > 300)

a    684.0
b    559.0
c    629.0
d      NaN
e    835.0
dtype: float64

In [95]:
# get the series with the kept value if the value > 300, else return -1 for that value
s.where(s > 300, -1)

a    684
b    559
c    629
d     -1
e    835
dtype: int32

In [96]:
# pass a callable as second arg, and return the value if value > 300 else (value * -1)
s.where(s > 300, lambda s_: s_ * -1)

a    684
b    559
c    629
d   -192
e    835
dtype: int32

In [97]:
# set all odd values to NaN
s.where(s % 2 == 0)

a    684.0
b      NaN
c      NaN
d    192.0
e      NaN
dtype: float64

#### 2.3.1 - Data Frames

In [99]:
print("boom")

boom

<br><hr><br>

### 2.4 - mask()

* Opposite of where()
    * Replaces values where the condition is True
    * The values that meet the condition are replaced with a specified value (defaults to NaN)
* Use when you want to ***replace values that meet a condition***

In [102]:
np.random.seed(0)
s = pd.Series(np.random.randint(0, 1000, 5), index=list('abcde'))
s

a    684
b    559
c    629
d    192
e    835
dtype: int32

In [103]:
s.mask(s % 2 == 0, lambda s_: s_ + 1)

a    685
b    559
c    629
d    193
e    835
dtype: int32

<br><hr><br>

### 2.5 - Masking

* reference the columns as series objects and compare them directly

In [106]:
np.random.seed(0)
s = pd.Series(np.random.randint(0, 1000, 5), index=list('abcde'))
s

a    684
b    559
c    629
d    192
e    835
dtype: int32

In [107]:
# get all values greater than 300
s > 300

a     True
b     True
c     True
d    False
e     True
dtype: bool

In [108]:
# apply boolean series as a mask index, getting back only those values that are > 650
s.loc[s > 650]  # "s > 650" is a mask index

a    684
e    835
dtype: int32

In [109]:
# replace values that are not  > 300 with NaN
s.loc[s <= 300] = np.nan
s

a    684.0
b    559.0
c    629.0
d      NaN
e    835.0
dtype: float64

<br><hr><hr><br>

# 3) Dates and Time

<br><hr><br>

### 3.1 - Extracting time components

In [114]:
df = pd.DataFrame({'datetime': ['2023-02-01 14:30:45', '2023-03-15 09:15:30', '2023-05-20 18:45:15']})
df['datetime'] = pd.to_datetime(df['datetime'])

print("Initial data frame:")
display(df)

df['year'] = df['datetime'].dt.year
df['month'] = df['datetime'].dt.month
df['day'] = df['datetime'].dt.day
df['weekday'] = df['datetime'].dt.weekday
df['quarter'] = df['datetime'].dt.quarter
df['hour'] = df['datetime'].dt.hour
df['minute'] = df['datetime'].dt.minute
df['second'] = df['datetime'].dt.second
df['month_name'] = df['datetime'].dt.month_name()
df['day_name'] = df['datetime'].dt.day_name()

print("Add extracted data as columns")
display(df)

Initial data frame:

             datetime
0 2023-02-01 14:30:45
1 2023-03-15 09:15:30
2 2023-05-20 18:45:15

Add extracted data as columns

,datetime,year,month,day,weekday,quarter,hour,minute,second,month_name,day_name
0,2023-02-01 14:30:45,2023,2,1,2,1,14,30,45,February,Wednesday
1,2023-03-15 09:15:30,2023,3,15,2,1,9,15,30,March,Wednesday
2,2023-05-20 18:45:15,2023,5,20,5,2,18,45,15,May,Saturday

<br><hr><br>

## 3.2 - Timestamp

* Automatically parse time objects, no matter the used format as argument

In [117]:
display(pd.Timestamp("2025/1/7"))
display(pd.Timestamp("2025-1-7"))
display(pd.Timestamp("2025, 1, 7"))

Timestamp('2025-01-07 00:00:00')

Timestamp('2025-01-07 00:00:00')

Timestamp('2025-01-07 00:00:00')

<br><hr><br>

## 3.3 - DateTimeIndex

* An index type that holds an array of timestamps
* This replaces the original index, unless using **df.reset_index()** to restore the original index

In [120]:
dates = ['2020/5/1', "2020/5/2", "2019/5/3"]
pd.DatetimeIndex(dates)

DatetimeIndex(['2020-05-01', '2020-05-02', '2019-05-03'], dtype='datetime64[ns]', freq=None)

In [121]:
# create a list of datetime objects
dates = [dt.datetime(2020, 5, 1), dt.datetime(2020, 5, 2), dt.datetime(2019, 5, 3)]

# turn the list into a DatetimeIndex
date_index = pd.DatetimeIndex(dates)

values = [12, 13, 10]

# create a Series and set the index to be based on date_index
series = pd.Series(data=values, index=date_index)
display(series)

2020-05-01    12
2020-05-02    13
2019-05-03    10
dtype: int64

<br><hr><br>

## 3.4 - Unixtime Format

In [124]:
# parse unixtime format to readable
unixtime = [12344567, 193456323, 104569231, 4523498221]
pd.to_datetime(unixtime, unit="s")

DatetimeIndex(['1970-05-23 21:02:47', '1976-02-18 01:52:03',
               '1973-04-25 07:00:31', '2113-05-06 07:17:01'],
              dtype='datetime64[ns]', freq=None)

<br><hr><br>

## 3.5 - Timedelta
* Represents a duration, which is the difference between two time points
* It can be used to express durations in various units like days, hours, minutes, seconds

In [127]:
# Timedelta creation, of 10 days t hours and 30 minutes
pd.Timedelta(weeks=1, days=3, hours=5, minutes=30)

Timedelta('10 days 05:30:00')

In [128]:
# Timedelta from a string
pd.Timedelta('10 days 5:30:00')

Timedelta('10 days 05:30:00')

In [129]:
# Timedelta with negative values
pd.Timedelta(days=-2, hours=-3)

Timedelta('-3 days +21:00:00')

In [130]:
# substract 2 datetime objects to obtain the Timedelta
dt_1 = pd.to_datetime("2024-01-01 10:00:00")
dt_2 = pd.to_datetime("2024-01-02 9:00:00")
dt_2 - dt_1

Timedelta('0 days 23:00:00')

In [131]:
# using custom units
pd.Timedelta(seconds=1000, milliseconds=500)

Timedelta('0 days 00:16:40.500000')

In [132]:
# adding and substracting a Timedelta to/from a datetime object
dt_1 = pd.to_datetime("2025-2-22 13:50:00")
td = pd.Timedelta(days=5, hours=3)
print(f"Original timestamp: {dt_1}")
print(f"Timedelta value: {td}")

# add
print("\nafter add")
display(dt_1 + td)

# subtract
print("\nafter subtract")
display(dt_1 - td)

Original timestamp: 2025-02-22 13:50:00
Timedelta value: 5 days 03:00:00

after add

Timestamp('2025-02-27 16:50:00')

after subtract

Timestamp('2025-02-17 10:50:00')

In [133]:
# create Timedelta from a range of days
pd.Timedelta(15, unit='D')

Timedelta('15 days 00:00:00')

<br><hr><br>

## 3.6 - date_range()

* Generates a sequence of timestamps (dates and times) based on a specified frequency
* Use cases:
<table>
  <thead>
    <tr>
      <th>Use Case</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Time Series Data</td>
      <td>Useful for financial data, weather data, or sensor data collection where you track every single calendar day</td>
    </tr>
    <tr>
      <td>Data Analysis</td>
      <td>When you want to generate a sequence of dates to analyze or forecast based on fixed time intervals like weekly, monthly, or yearly ranges</td>
    </tr>
    <tr>
      <td>Event Scheduling</td>
      <td>Scheduling tasks or reminders with specific frequency, for example, sending reminders every 1st of the month or setting up daily tasks</td>
    </tr>
    <tr>
      <td>Date-based Reports</td>
      <td>Generating date ranges for reports such as monthly, weekly, or yearly reports based on exact calendar dates, useful in business analysis, sales reports, etc</td>
    </tr>
  </tbody>
</table>

### 3.6.1 - Generate dates

In [137]:
times = pd.date_range(start="2021-7-9", end="2022-7-9", freq='D')
times

DatetimeIndex(['2021-07-09', '2021-07-10', '2021-07-11', '2021-07-12',
               '2021-07-13', '2021-07-14', '2021-07-15', '2021-07-16',
               '2021-07-17', '2021-07-18',
               ...
               '2022-06-30', '2022-07-01', '2022-07-02', '2022-07-03',
               '2022-07-04', '2022-07-05', '2022-07-06', '2022-07-07',
               '2022-07-08', '2022-07-09'],
              dtype='datetime64[ns]', length=366, freq='D')

In [138]:
times = pd.date_range(start="2021-7-9", end="2022-7-9", freq='A')
times

C:\Users\pacur\AppData\Local\Temp\ipykernel_1588\3611537975.py:1: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  times = pd.date_range(start="2021-7-9", end="2022-7-9", freq='A')

DatetimeIndex(['2021-12-31'], dtype='datetime64[ns]', freq='YE-DEC')

### 3.6.2 - Frequencies

* Time-based Frequencies:
<table>
  <thead>
    <tr>
      <th>Code</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>'B' or 'b'</td>
      <td>Business day frequency (Monday to Friday, excluding holidays)</td>
    </tr>
    <tr>
      <td>'C'</td>
      <td>Custom business day frequency (can be customized with holidays)</td>
    </tr>
    <tr>
      <td>'D'</td>
      <td>Calendar day frequency (every day)</td>
    </tr>
    <tr>
      <td>'W'</td>
      <td>Weekly frequency (every week)</td>
    </tr>
    <tr>
      <td>'W-MON' to 'W-SUN'</td>
      <td>Weekly frequency, but only on the specified day of the week.</td>
    </tr>
    <tr>
      <td>'ME'</td>
      <td>Month-end frequency (last business day of the month)</td>
    </tr>
    <tr>
      <td>'SME'</td>
      <td>Semi-monthly frequency (15th and end of the month)</td>
    </tr>
    <tr>
      <td>'BME'</td>
      <td>Business month-end frequency (last business day of the month)</td>
    </tr>
    <tr>
      <td>'MS'</td>
      <td>Month start frequency (first business day of the month)</td>
    </tr>
    <tr>
      <td>'BMS'</td>
      <td>Business month start frequency (first business day of the month)</td>
    </tr>
  </tbody>
</table>


* Year-based Frequencies
<table>
  <thead>
    <tr>
      <th>Code</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>'A' or 'Y'</td>
      <td>Year-end frequency (last business day of the year)</td>
    </tr>
    <tr>
      <td>'AS' or 'YS'</td>
      <td>Year start frequency (first business day of the year)</td>
    </tr>
    <tr>
      <td>'BA' or 'BY'</td>
      <td>Business year-end frequency (last business day of the year)</td>
    </tr>
    <tr>
      <td>'BAS' or 'BYS'</td>
      <td>Business year start frequency (first business day of the year)</td>
    </tr>
  </tbody>
</table>


* Hour, Minute, Second Frequencies:
<table>
  <thead>
    <tr>
      <th>Code</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>'H'</td>
      <td>Hourly frequency</td>
    </tr>
    <tr>
      <td>'T' or 'min'</td>
      <td>Minute frequency</td>
    </tr>
    <tr>
      <td>'S'</td>
      <td>Second frequency</td>
    </tr>
    <tr>
      <td>'L' or 'ms'</td>
      <td>Millisecond frequency</td>
    </tr>
    <tr>
      <td>'U' or 'us'</td>
      <td>Microsecond frequency</td>
    </tr>
  </tbody>
</table>


* Other Frequencies:
<table>
  <thead>
    <tr>
      <th>Code</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>'Q'</td>
      <td>Quarter-end frequency</td>
    </tr>
    <tr>
      <td>'QS'</td>
      <td>Quarter start frequency</td>
    </tr>
    <tr>
      <td>'BQS'</td>
      <td>Business quarter start frequency</td>
    </tr>
    <tr>
      <td>'BQE'</td>
      <td>Business quarter end frequency</td>
    </tr>
  </tbody>
</table>

In [140]:
# "B": business day range
pd.date_range(start="2024-01-01", periods=10, freq="B")

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-08', '2024-01-09', '2024-01-10',
               '2024-01-11', '2024-01-12'],
              dtype='datetime64[ns]', freq='B')

In [141]:
# "D": daily range
pd.date_range(start="2024-01-01", periods=10, freq="D")

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [142]:
# "W": weekly range
pd.date_range(start="2024-01-01", periods=10, freq="W")

DatetimeIndex(['2024-01-07', '2024-01-14', '2024-01-21', '2024-01-28',
               '2024-02-04', '2024-02-11', '2024-02-18', '2024-02-25',
               '2024-03-03', '2024-03-10'],
              dtype='datetime64[ns]', freq='W-SUN')

In [143]:
# "W-MON": every monday for a given period
pd.date_range(start="2024-01-01", periods=10, freq="W-MON")

DatetimeIndex(['2024-01-01', '2024-01-08', '2024-01-15', '2024-01-22',
               '2024-01-29', '2024-02-05', '2024-02-12', '2024-02-19',
               '2024-02-26', '2024-03-04'],
              dtype='datetime64[ns]', freq='W-MON')

In [144]:
# "MS": month-start range
pd.date_range(start="2024-01-01", periods=10, freq="MS")

DatetimeIndex(['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01',
               '2024-05-01', '2024-06-01', '2024-07-01', '2024-08-01',
               '2024-09-01', '2024-10-01'],
              dtype='datetime64[ns]', freq='MS')

In [145]:
# "ME": month-end range
pd.date_range(start="2024-01-01", periods=10, freq="ME")

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31'],
              dtype='datetime64[ns]', freq='ME')

In [146]:
# hourly range
pd.date_range(start="2024-01-01", periods=10, freq="H")

C:\Users\pacur\AppData\Local\Temp\ipykernel_1588\1018285598.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  pd.date_range(start="2024-01-01", periods=10, freq="H")

DatetimeIndex(['2024-01-01 00:00:00', '2024-01-01 01:00:00',
               '2024-01-01 02:00:00', '2024-01-01 03:00:00',
               '2024-01-01 04:00:00', '2024-01-01 05:00:00',
               '2024-01-01 06:00:00', '2024-01-01 07:00:00',
               '2024-01-01 08:00:00', '2024-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='h')

In [147]:
# "SME": semi-monthly frequency (15th and the end of the month)
pd.date_range(start="2024-01-01", periods=10, freq="SME")

DatetimeIndex(['2024-01-15', '2024-01-31', '2024-02-15', '2024-02-29',
               '2024-03-15', '2024-03-31', '2024-04-15', '2024-04-30',
               '2024-05-15', '2024-05-31'],
              dtype='datetime64[ns]', freq='SME-15')

In [148]:
# BMS": business month-start frequency
pd.date_range(start="2024-01-01", periods=10, freq="BMS")

DatetimeIndex(['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01',
               '2024-05-01', '2024-06-03', '2024-07-01', '2024-08-01',
               '2024-09-02', '2024-10-01'],
              dtype='datetime64[ns]', freq='BMS')

In [149]:
# "BME": business month-end frequency
pd.date_range(start="2024-01-01", periods=10, freq="BME")

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-29', '2024-04-30',
               '2024-05-31', '2024-06-28', '2024-07-31', '2024-08-30',
               '2024-09-30', '2024-10-31'],
              dtype='datetime64[ns]', freq='BME')

<br><hr><br>

## 3.7 - bdate_range()

1.   List item
2.   List item



* Generate a range of business days (weekdays excluding weekends and optionally specified holidays)
* Use cases:
<table>
  <thead>
    <tr>
      <th>Use Case</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Financial Data Analysis</td>
      <td>Useful for financial data, weather data, or sensor data collection where you track every single calendar day</td>
    </tr>
    <tr>
      <td>Business Scheduling</td>
      <td>Creating schedules for business operations that operate only on weekdays, such as employee shifts, meetings, or deadlines that dont occur over the weekend</td>
    </tr>
    <tr>
      <td>Work Hours Tracking</td>
      <td>Tracking the hours worked or number of tasks completed on business days, such as in project management, time tracking, or productivity analysis.</td>
    </tr>
    <tr>
      <td>Data Aggregation</td>
      <td>Aggregating data to focus on business days only, which can be important for sales reports, payroll, or market analysis where weekend data is irrelevant</td>
    </tr>
  </tbody>
</table>

### 3.7.1 - Generate dates

In [153]:
# generate business days between "start" and "end" interval
bdays = pd.bdate_range(start="2023-01-01", end="2025-01-10")
bdays

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06', '2023-01-09', '2023-01-10', '2023-01-11',
               '2023-01-12', '2023-01-13',
               ...
               '2024-12-30', '2024-12-31', '2025-01-01', '2025-01-02',
               '2025-01-03', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', length=530, freq='B')

In [154]:
# generate the next 10 business days starting from "start" value
bdays = pd.bdate_range(start="2023-01-01", periods=10)
bdays

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06', '2023-01-09', '2023-01-10', '2023-01-11',
               '2023-01-12', '2023-01-13'],
              dtype='datetime64[ns]', freq='B')

### 3.7.2 - Frequencies

* Time-based Frequencies:
<table>
    <tr>
        <th>Code</th>
        <th>Description</th>
    </tr>
    <tr>
        <td>'B' or 'b'</td>
        <td>Business day frequency (Monday to Friday, excluding holidays)</td>
    </tr>
    <tr>
        <td>'C'</td>
        <td>Custom business day frequency (can be customized with holidays)</td>
    </tr>
    <tr>
        <td>'D'</td>
        <td>Calendar day frequency (every day)</td>
    </tr>
    <tr>
        <td>'W'</td>
        <td>Weekly frequency (every week)</td>
    </tr>
    <tr>
        <td>
            'W-MON' to W-SUN
        </td>
        <td>Weekly frequency, but only on the specified day of the week.</td>
    </tr>
    <tr>
        <td>'ME'</td>
        <td>Month-end frequency (last business day of the month)</td>
    </tr>
    <tr>
        <td>'SME'</td>
        <td>Semi-monthly frequency (15th and end of the month)</td>
    </tr>
    <tr>
        <td>'BME'</td>
        <td>Business month-end frequency (last business day of the month)</td>
    </tr>
    <tr>
        <td>'MS'</td>
        <td>Month start frequency (first business day of the month)</td>
    </tr>
    <tr>
        <td>'BMS'</td>
        <td>Business month start frequency (first business day of the month)</td>
    </tr>
</table>


* Year-based Frequencies:
<table>
    <tr>
        <th>Code</th>
        <th>Description</th>
    </tr>
    <tr>
        <td>'A' or 'Y'</td>
        <td>Year-end frequency (last business day of the year)</td>
    </tr>
    <tr>
        <td>'AS' or 'YS'</td>
        <td>Year start frequency (first business day of the year)</td>
    </tr>
    <tr>
        <td>'BA' or 'BY'</td>
        <td>Business year-end frequency (last business day of the year)</td>
    </tr>
    <tr>
        <td>'BAS' or 'BYS'</td>
        <td>Business year start frequency (first business day of the year)</td>
    </tr>
</table>


* Hour, Minute, Second Frequencies:
<table>
    <tr>
        <th>Code</th>
        <th>Description</th>
    </tr>
    <tr>
        <td>'H'</td>
        <td>Hourly frequency</td>
    </tr>
    <tr>
        <td>'T' or 'min'</td>
        <td>Minute frequency</td>
    </tr>
    <tr>
        <td>'S'</td>
        <td>Second frequency</td>
    </tr>
    <tr>
        <td>'L' or 'ms'</td>
        <td>Millisecond frequency</td>
    </tr>
    <tr>
        <td>'U' or 'us'</td>
        <td>Microsecond frequency</td>
    </tr>
</table>


* Other Frequencies:
<table>
    <tr>
        <th>Code</th>
        <th>Description</th>
    </tr>
    <tr>
        <td>'Q'</td>
        <td>Quarter-end frequency</td>
    </tr>
    <tr>
        <td>'QS'</td>
        <td>Quarter start frequency</td>
    </tr>
    <tr>
        <td>'BQS'</td>
        <td>Business quarter start frequency</td>
    </tr>
    <tr>
        <td>'BQE'</td>
        <td>Business quarter end frequency</td>
    </tr>
</table>

In [156]:
# "B": Business day frequency (Monday to Friday, excluding holidays)
pd.bdate_range(start="2025-1-1", end="2025-1-1", freq="B")

DatetimeIndex(['2025-01-01'], dtype='datetime64[ns]', freq='B')

In [157]:
# 2. "C": Custom business day frequency (can be customized with holidays)
holidays = ["2025-01-01", "2025-01-06"]  # Example holidays

# specify holidays using the 'holidays' parameter
custom_business_days = pd.bdate_range(start="2025-01-01", end="2025-01-10", freq="C", holidays=holidays)
print("\nCustom Business Day Frequency (excluding holidays):")
print(custom_business_days)

Custom Business Day Frequency (excluding holidays):
DatetimeIndex(['2025-01-02', '2025-01-03', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='C')

In [158]:
# "D": Calendar day frequency (every day)
pd.date_range(start="2025-01-01", end="2025-01-10", freq="D")

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='D')

In [159]:
# "W": Weekly frequency (every week)
pd.date_range(start="2025-01-01", end="2025-02-01", freq="W")

DatetimeIndex(['2025-01-05', '2025-01-12', '2025-01-19', '2025-01-26'], dtype='datetime64[ns]', freq='W-SUN')

In [160]:
# "W-MON", "W-TUE", "W-WED", "W-THU", "W-FRI", "W-SAT", "W-SUN": Weekly frequency, but only on the specified day of the week
pd.date_range(start="2025-01-01", end="2025-01-31", freq="W-MON")

DatetimeIndex(['2025-01-06', '2025-01-13', '2025-01-20', '2025-01-27'], dtype='datetime64[ns]', freq='W-MON')

In [161]:
# "ME": Month-End frequency (last business day of the month)
pd.date_range(start="2025-01-01", end="2025-12-31", freq="ME")

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-31', '2025-06-30', '2025-07-31', '2025-08-31',
               '2025-09-30', '2025-10-31', '2025-11-30', '2025-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [162]:
# "SME": Semi-Monthly End frequency (15th and end of the month)
pd.date_range(start="2025-01-01", end="2025-12-31", freq="SME")

DatetimeIndex(['2025-01-15', '2025-01-31', '2025-02-15', '2025-02-28',
               '2025-03-15', '2025-03-31', '2025-04-15', '2025-04-30',
               '2025-05-15', '2025-05-31', '2025-06-15', '2025-06-30',
               '2025-07-15', '2025-07-31', '2025-08-15', '2025-08-31',
               '2025-09-15', '2025-09-30', '2025-10-15', '2025-10-31',
               '2025-11-15', '2025-11-30', '2025-12-15', '2025-12-31'],
              dtype='datetime64[ns]', freq='SME-15')

In [163]:
# "BME": Business Month-End frequency (last business day of the month)
pd.bdate_range(start="2025-01-01", end="2025-12-31", freq="BME")

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-30', '2025-06-30', '2025-07-31', '2025-08-29',
               '2025-09-30', '2025-10-31', '2025-11-28', '2025-12-31'],
              dtype='datetime64[ns]', freq='BME')

In [164]:
# "MS": Month Start frequency (first business day of the month)
pd.date_range(start="2025-01-01", end="2025-12-31", freq="MS")

DatetimeIndex(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01',
               '2025-05-01', '2025-06-01', '2025-07-01', '2025-08-01',
               '2025-09-01', '2025-10-01', '2025-11-01', '2025-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [165]:
# "BMS": Business Month start frequency (first business day of the month)
pd.bdate_range(start="2025-01-01", end="2025-12-31", freq="BMS")

DatetimeIndex(['2025-01-01', '2025-02-03', '2025-03-03', '2025-04-01',
               '2025-05-01', '2025-06-02', '2025-07-01', '2025-08-01',
               '2025-09-01', '2025-10-01', '2025-11-03', '2025-12-01'],
              dtype='datetime64[ns]', freq='BMS')

<br><hr><br>

## 3.8 - period_range()

* Generates a sequence of periods (like months, years, or days), rather than exact timestamps (like a date)
* Periods are an abstraction in pandas where the time is measured in a specific frequency (like monthly or yearly)
* Use cases:
    * ***Generating monthly financial reports***
    * ***Generating quarterly ranges***

### 3.8.1 - Generate periods

In [169]:
pd.period_range(start="2024-01-01", periods=5, freq="M")

PeriodIndex(['2024-01', '2024-02', '2024-03', '2024-04', '2024-05'], dtype='period[M]')

### 3.8.2 - Frequencies

<table>
    <thead>
        <tr>
            <th>Code</th>
            <th>Description</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td>'D'</td>
            <td>Calendar day frequency (e.g., days).</td>
        </tr>
        <tr>
            <td>'B'</td>
            <td>Business day frequency (Monday to Friday, excluding holidays).</td>
        </tr>
        <tr>
            <td>'W'</td>
            <td>Weekly frequency (every week).</td>
        </tr>
        <tr>
            <td>'W-MON' to 'W-SUN'</td>
            <td>Weekly frequency, but only on the specified day of the week (e.g., 'W-MON' for Monday).</td>
        </tr>
        <tr>
            <td>'M'</td>
            <td>Monthly frequency (end of the month).</td>
        </tr>
        <tr>
            <td>'SM'</td>
            <td>Semi-monthly frequency (15th and end of the month).</td>
        </tr>
        <tr>
            <td>'MS'</td>
            <td>Month start frequency (first day of the month).</td>
        </tr>
        <tr>
            <td>'BMS'</td>
            <td>Business month start frequency (first business day of the month).</td>
        </tr>
        <tr>
            <td>'BME'</td>
            <td>Business month-end frequency (last business day of the month).</td>
        </tr>
        <tr>
            <td>'A' or 'Y'</td>
            <td>Year-end frequency (last day of the year).</td>
        </tr>
        <tr>
            <td>'AS' or 'YS'</td>
            <td>Year start frequency (first day of the year).</td>
        </tr>
        <tr>
            <td>'Q'</td>
            <td>Quarter-end frequency.</td>
        </tr>
        <tr>
            <td>'QS'</td>
            <td>Quarter start frequency.</td>
        </tr>
    </tbody>
</table>

<br><hr><br>

## 3.9 - timedelta_range()

* Generates a range of Timedelta objects, representing differences between timestamps
* This is useful when you want to create a series of time differences (like 5 minutes, 10 days, etc.)
* Use cases:
    * ***Time differences for event duraions***

### 3.9.1 - Generate timedelta

In [174]:
pd.timedelta_range(start="0 days", periods=5, freq="D")

TimedeltaIndex(['0 days', '1 days', '2 days', '3 days', '4 days'], dtype='timedelta64[ns]', freq='D')

In [175]:
# get time difference by stubstracting 2 given times

time_a = pd.Timestamp("2025-2-22 13:24:00")
time_b = pd.Timestamp("2025-2-23 13:24:00")

time_b - time_a

Timedelta('1 days 00:00:00')

### 3.9.2 - Frequencies

<table>
    <thead>
        <tr>
            <th>Code</th>
            <th>Description</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td>'D'</td>
            <td>Day frequency (e.g., 1 day).</td>
        </tr>
        <tr>
            <td>'h'</td>
            <td>Hourly frequency (e.g., 1 hour).</td>
        </tr>
        <tr>
            <td>'min'</td>
            <td>Minute frequency (e.g., 1 minute).</td>
        </tr>
        <tr>
            <td>'s'</td>
            <td>Second frequency (e.g., 1 second).</td>
        </tr>
        <tr>
            <td>'ms'</td>
            <td>Millisecond frequency (e.g., 1 millisecond).</td>
        </tr>
        <tr>
            <td>'us'</td>
            <td>Microsecond frequency (e.g., 1 microsecond).</td>
        </tr>
    </tbody>
</table>

In [177]:
# "D": day frequency
pd.timedelta_range(start="0 days", periods=10, freq="D")

TimedeltaIndex(['0 days', '1 days', '2 days', '3 days', '4 days', '5 days',
                '6 days', '7 days', '8 days', '9 days'],
               dtype='timedelta64[ns]', freq='D')

In [178]:
# "h": hourly frequency
pd.timedelta_range(start="0 hours", periods=10, freq="h")

TimedeltaIndex(['0 days 00:00:00', '0 days 01:00:00', '0 days 02:00:00',
                '0 days 03:00:00', '0 days 04:00:00', '0 days 05:00:00',
                '0 days 06:00:00', '0 days 07:00:00', '0 days 08:00:00',
                '0 days 09:00:00'],
               dtype='timedelta64[ns]', freq='h')

In [179]:
# "min": minute frequency
pd.timedelta_range(start="0 minutes", periods=10, freq="min")

TimedeltaIndex(['0 days 00:00:00', '0 days 00:01:00', '0 days 00:02:00',
                '0 days 00:03:00', '0 days 00:04:00', '0 days 00:05:00',
                '0 days 00:06:00', '0 days 00:07:00', '0 days 00:08:00',
                '0 days 00:09:00'],
               dtype='timedelta64[ns]', freq='min')

In [180]:
# "s": second frequency
pd.timedelta_range(start="0 seconds", periods=10, freq="s")

TimedeltaIndex(['0 days 00:00:00', '0 days 00:00:01', '0 days 00:00:02',
                '0 days 00:00:03', '0 days 00:00:04', '0 days 00:00:05',
                '0 days 00:00:06', '0 days 00:00:07', '0 days 00:00:08',
                '0 days 00:00:09'],
               dtype='timedelta64[ns]', freq='s')

In [181]:
 # "ms": millisecond frequency
pd.timedelta_range(start="0 milliseconds", periods=10, freq="ms")

TimedeltaIndex([       '0 days 00:00:00', '0 days 00:00:00.001000',
                '0 days 00:00:00.002000', '0 days 00:00:00.003000',
                '0 days 00:00:00.004000', '0 days 00:00:00.005000',
                '0 days 00:00:00.006000', '0 days 00:00:00.007000',
                '0 days 00:00:00.008000', '0 days 00:00:00.009000'],
               dtype='timedelta64[ns]', freq='ms')

In [182]:
# "us": microsecond frequency
pd.timedelta_range(start="0 microseconds", periods=10, freq="us")

TimedeltaIndex([       '0 days 00:00:00', '0 days 00:00:00.000001',
                '0 days 00:00:00.000002', '0 days 00:00:00.000003',
                '0 days 00:00:00.000004', '0 days 00:00:00.000005',
                '0 days 00:00:00.000006', '0 days 00:00:00.000007',
                '0 days 00:00:00.000008', '0 days 00:00:00.000009'],
               dtype='timedelta64[ns]', freq='us')

<br><hr><hr><br>

# 4) Data Wrangling

<br><hr><br>

In [186]:
rewards.head()

,User ID,Birthdate,City,State,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
0,1,1/31/1992,Minneapolis,Georgia,55401,300,300,0,9/4/2020 0:15,12/16/2021 17:42,ClassOf2025
1,2,NaN,Los Angeles,Colorado,90210,320,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
2,3,1/11/1990,Merida,AL,97204,330,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer
3,4,4/16/1990,Winston-Salem,NC,27106,10790,14290,3500,8/18/2020 13:21,6/30/2022 22:22,GraduateStudent|admin|MBBvsDuke
4,5,3/24/1994,Winston-Salem,NC,27109,650,650,0,8/21/2020 11:27,12/30/2020 10:57,Student|NOBSBvsNDGame3|NOBSBvsNDGame3A

In [187]:
# use sum() to get the total of missing values
missing_value_counts = rewards.isna().sum()
missing_value_counts

User ID                   0
Birthdate              6080
City                   6922
State                  6922
Zip                    6922
Available Points          0
Total Points Earned       0
Points Spent              0
Joined On                 0
Last Seen               221
Tags                      0
dtype: int64

In [188]:
# create and display missing value percentages variable
missing_value_percentages = missing_value_counts / len(rewards) * 100
missing_value_percentages

User ID                 0.000000
Birthdate              83.838941
City                   95.449531
State                  95.449531
Zip                    95.449531
Available Points        0.000000
Total Points Earned     0.000000
Points Spent            0.000000
Joined On               0.000000
Last Seen               3.047435
Tags                    0.000000
dtype: float64

In [189]:
rewards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7252 entries, 0 to 7251
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   User ID              7252 non-null   int64
 1   Birthdate            1172 non-null   object
 2   City                 330 non-null    object
 3   State                330 non-null    object
 4   Zip                  330 non-null    object
 5   Available Points     7252 non-null   int64
 6   Total Points Earned  7252 non-null   int64
 7   Points Spent         7252 non-null   int64
 8   Joined On            7252 non-null   object
 9   Last Seen            7031 non-null   object
 10  Tags                 7252 non-null   object
dtypes: int64(4), object(7)
memory usage: 623.3+ KB

In [190]:
# convert the "Last Seen" column from a generic object date type to datetime
rewards["Last Seen"] = pd.to_datetime(rewards["Last Seen"])
rewards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7252 entries, 0 to 7251
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   User ID              7252 non-null   int64
 1   Birthdate            1172 non-null   object
 2   City                 330 non-null    object
 3   State                330 non-null    object
 4   Zip                  330 non-null    object
 5   Available Points     7252 non-null   int64
 6   Total Points Earned  7252 non-null   int64
 7   Points Spent         7252 non-null   int64
 8   Joined On            7252 non-null   object
 9   Last Seen            7031 non-null   datetime64[ns]
 10  Tags                 7252 non-null   object
dtypes: datetime64[ns](1), int64(4), object(6)
memory usage: 623.3+ KB

In [191]:
# find the range of dates
min_date = rewards["Last Seen"].min()
max_date = rewards["Last Seen"].max()
print(f'{min_date} - {max_date}')

print(f'count of min_date in original df: {(rewards["Last Seen"] == min_date).sum()}')

new_df = rewards.copy()
new_df["Last Seen"] = new_df["Last Seen"].fillna(value=min_date)

print(f'count of min_date in no na df: {(new_df["Last Seen"] == min_date).sum()}')

2020-10-12 14:38:00 - 2022-07-01 08:36:00
count of min_date in original df: 1
count of min_date in no na df: 222

In [192]:
# drop records with missing values and assign result to new dataframe
rewards_df_sample = rewards.dropna()
missing_counts = rewards_df_sample.notna().sum()
missing_counts

User ID                172
Birthdate              172
City                   172
State                  172
Zip                    172
Available Points       172
Total Points Earned    172
Points Spent           172
Joined On              172
Last Seen              172
Tags                   172
dtype: int64

In [193]:
# drop the "Tags" column from rewards_sample
rewards_sample = rewards.copy()
rewards_sample = rewards.sample().drop(columns="Tags")
rewards_sample.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 5169 to 5169
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   User ID              1 non-null      int64
 1   Birthdate            0 non-null      object
 2   City                 0 non-null      object
 3   State                0 non-null      object
 4   Zip                  0 non-null      object
 5   Available Points     1 non-null      int64
 6   Total Points Earned  1 non-null      int64
 7   Points Spent         1 non-null      int64
 8   Joined On            1 non-null      object
 9   Last Seen            1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 88.0+ bytes

<br><hr><br>

## 4.1 - Get Unique City using Pandas (Recommended)

In [196]:
import pandas as pd

rewards_sample = rewards.copy()

# get unique cities, remove NaN, and convert to string
city_vals = rewards_sample['City'].dropna().astype(str)

# normalize cities: strip spaces, replace dashes/commas with space, and standardize capitalization
city_vals = city_vals.str.strip().str.replace(r"[-,]", " ", regex=True).str.title()

# get unique values and sort them
unique_sorted = city_vals.drop_duplicates().sort_values(ignore_index=True)

print(f"Initial count: {city_vals.shape[0]}; Uniques count: {unique_sorted.shape[0]}")
np.array(unique_sorted)

Initial count: 330; Uniques count: 136

array(['Anderson', 'Anthem', 'Ashburn', 'Asheboro', 'Atlanta', 'Aurora',
       'Austin', 'Bakersfield', 'Baltimore', 'Belmont', 'Bethesda',
       'Big Flats', 'Blaine', 'Bourne', 'Cary', 'Chapel Hill',
       'Charlotte', 'Chester Springs', 'Chevy Chase', 'Clemmons',
       'Cleveland', 'Clovis', 'Dallas', 'Darien', 'Delhi', 'Delran',
       'Dover', 'Downers Grove', 'Dublin', 'Durham', 'Duxbury', 'Edina',
       'Fairfield', 'Fort Myers', 'Frankfort', 'G', 'Gainesville',
       'Glen Mills', 'Glenview', 'Goldsboro', 'Greensboro', 'Guaynabo',
       'Harrison', 'Hickory', 'Huntersville', 'Indian Trail', 'Jackson',
       'Jacksonville', 'Jamesville', 'Kenneth Square', 'Lafayette',
       'Larchmont', 'Lexington', 'Libertyville', 'Lincoln University',
       'Littleton', 'Lmao', 'Locust', 'Long Valley', 'Los Angeles',
       'Louisville', 'Loveland', 'Lutherville', 'Madison', 'Malvern',
       'Manhattan Beach', 'Maple Grove', 'Marblehead', 'Mclean', 'Medina',
       'Memphis', 'Merida', 'Midlothian', 'Milwaukee', 'Minneapolis',
       'Mooresville', 'Morganton', 'Mt. Pleasant', 'Naples', 'Nashville',
       'Natick', 'Newtown Square', 'Northport', 'Oak Ridge', 'Oakwood',
       'Orleans', 'Ormond Beach', 'Palm Beach Gardens', 'Palm Harbor',
       'Palmetto Bay', 'Perry', 'Pfafftown', 'Piedmont', 'Pinehurst',
       'Pittsburgh', 'Potomac', 'Raleigh', 'Rex', 'Rich Square',
       'Rockville', 'Rocky Hill', 'Rome', 'San Francisco', 'San Marcos',
       'Sandy Springs', 'Scituate', 'Seneca', 'Shaker Hts', 'Sharon',
       'Silver Spring', 'Smithtown', 'Smyrna', 'Summit', 'Supply',
       'Terrace Park', 'The Woodlands', 'Thomasville', 'Valrico',
       'Vero Beach', 'Vienna', 'Walkertown', 'Warren', 'Washington',
       'Waukegan', 'Waxhaw', 'Wellesley', 'West Chester', 'Weston',
       'Westport', 'Whippany', 'Whitesboro', 'Wilmette', 'Winston Salem',
       'Winston Salem  Nc', 'Wyckoff', 'Wyomissing'], dtype=object)

<br><hr><br>

## 4.2 - Get Unique City using numpy (Alternative)

In [199]:
rewards_sample = rewards.copy()

# remove NaN, make sure only strings are selected, and convert to a NumPy array
city_vals = rewards_sample['City'].dropna().astype(str).to_numpy()

# normalize cities: strip spaces, replace dashes/commas with space, and standardize capitalization
city_vals = np.array([city.strip().replace("-", " ").replace(",", "").title() for city in city_vals])

# get unique values and sort them using NumPy
unique_sorted = np.sort(np.unique(city_vals))

print(f"Initial count: {city_vals.shape[0]}; Uniques count: {unique_sorted.shape[0]}")
unique_sorted

Initial count: 330; Uniques count: 136

array(['Anderson', 'Anthem', 'Ashburn', 'Asheboro', 'Atlanta', 'Aurora',
       'Austin', 'Bakersfield', 'Baltimore', 'Belmont', 'Bethesda',
       'Big Flats', 'Blaine', 'Bourne', 'Cary', 'Chapel Hill',
       'Charlotte', 'Chester Springs', 'Chevy Chase', 'Clemmons',
       'Cleveland', 'Clovis', 'Dallas', 'Darien', 'Delhi', 'Delran',
       'Dover', 'Downers Grove', 'Dublin', 'Durham', 'Duxbury', 'Edina',
       'Fairfield', 'Fort Myers', 'Frankfort', 'G', 'Gainesville',
       'Glen Mills', 'Glenview', 'Goldsboro', 'Greensboro', 'Guaynabo',
       'Harrison', 'Hickory', 'Huntersville', 'Indian Trail', 'Jackson',
       'Jacksonville', 'Jamesville', 'Kenneth Square', 'Lafayette',
       'Larchmont', 'Lexington', 'Libertyville', 'Lincoln University',
       'Littleton', 'Lmao', 'Locust', 'Long Valley', 'Los Angeles',
       'Louisville', 'Loveland', 'Lutherville', 'Madison', 'Malvern',
       'Manhattan Beach', 'Maple Grove', 'Marblehead', 'Mclean', 'Medina',
       'Memphis', 'Merida', 'Midlothian', 'Milwaukee', 'Minneapolis',
       'Mooresville', 'Morganton', 'Mt. Pleasant', 'Naples', 'Nashville',
       'Natick', 'Newtown Square', 'Northport', 'Oak Ridge', 'Oakwood',
       'Orleans', 'Ormond Beach', 'Palm Beach Gardens', 'Palm Harbor',
       'Palmetto Bay', 'Perry', 'Pfafftown', 'Piedmont', 'Pinehurst',
       'Pittsburgh', 'Potomac', 'Raleigh', 'Rex', 'Rich Square',
       'Rockville', 'Rocky Hill', 'Rome', 'San Francisco', 'San Marcos',
       'Sandy Springs', 'Scituate', 'Seneca', 'Shaker Hts', 'Sharon',
       'Silver Spring', 'Smithtown', 'Smyrna', 'Summit', 'Supply',
       'Terrace Park', 'The Woodlands', 'Thomasville', 'Valrico',
       'Vero Beach', 'Vienna', 'Walkertown', 'Warren', 'Washington',
       'Waukegan', 'Waxhaw', 'Wellesley', 'West Chester', 'Weston',
       'Westport', 'Whippany', 'Whitesboro', 'Wilmette', 'Winston Salem',
       'Winston Salem Nc', 'Wyckoff', 'Wyomissing'], dtype='<U18')

<br><hr><br>

## 4.3 - Fix States and Zip codes

In [202]:
us_state_to_abbrev = {"Alabama": "AL", "Alaska": "AK", "Arizona": "AZ", "Arkansas": "AR", "California": "CA", "Colorado": "CO", "Connecticut": "CT", "Delaware": "DE", "Florida": "FL",
                      "Georgia": "GA", "Hawaii": "HI", "Idaho": "ID", "Illinois": "IL", "Indiana": "IN", "Iowa": "IA", "Kansas": "KS", "Kentucky": "KY", "Louisiana": "LA", "Maine": "ME",
                      "Maryland": "MD", "Massachusetts": "MA", "Michigan": "MI", "Minnesota": "MN", "Mississippi": "MS", "Missouri": "MO", "Montana": "MT", "Nebraska": "NE", "Nevada": "NV",
                      "New Hampshire": "NH", "New Jersey": "NJ", "New Mexico": "NM", "New York": "NY", "North Carolina": "NC", "North Dakota": "ND", "Ohio": "OH", "Oklahoma": "OK", "Oregon": "OR",
                      "Pennsylvania": "PA", "Rhode Island": "RI", "South Carolina": "SC", "South Dakota": "SD", "Tennessee": "TN", "Texas": "TX", "Utah": "UT", "Vermont": "VT", "Virginia": "VA",
                      "Washington": "WA", "West Virginia": "WV", "Wisconsin": "WI", "Wyoming": "WY", "District of Columbia": "DC", "American Samoa": "AS", "Guam": "GU",
                      "Northern Mariana Islands": "MP", "Puerto Rico": "PR", "United States Minor Outlying Islands": "UM", "Virgin Islands, U.S.": "VI"}

# TODO: continue here with lowercase() to match the remaining elements

In [203]:
rewards_sample = rewards.copy()

rewards_sample["State"] = rewards_sample["State"].str.replace(r"[-,]", " ", regex=True).str.strip().str.lower()

for k, v in us_state_to_abbrev.items():
    rewards_sample["State"] = rewards_sample["State"].replace(to_replace=k, value=v)

unique_states = rewards_sample["State"].dropna().astype(str).drop_duplicates().sort_values(ignore_index=True)
original = rewards_sample["State"].dropna().to_numpy()
unique_states.to_numpy(), len(unique_states.to_numpy())

(array(['al', 'az', 'ca', 'california', 'co', 'colorado', 'connecticut',
        'ct', 'district of columbia', 'fl', 'florida', 'ga', 'georgia',
        'il', 'illinois', 'kentucky', 'ky', 'ma', 'maryland',
        'massachusetts', 'md', 'mn', 'ms', 'nc', 'new jersey',
        'new mexico', 'new york', 'nj', 'north carolina', 'ny', 'oh',
        'ohio', 'pa', 'pennsylvania', 'puerto rico', 'sc', 'tennessee',
        'texas', 'tn', 'tx', 'va', 'wi'], dtype=object),
 42)